[{"pmid": "33053381", "title": "Treatment for COVID-19: An overview.", "authors": ["Stasi, Cristina", "Fallani, Silvia", "Voller, Fabio", "Silvestri, Caterina"], "abstract": "Coronavirus disease 2019 (COVID-19) is an infectious disease caused by coronavirus-2 (SARS-CoV-2) that causes a severe acute respiratory syndrome, a characteristic hyperinflammatory response, vascular damage, microangiopathy, angiogenesis and widespread thrombosis. Four stages of COVID-19 have been identified: the first stage is characterised by upper respiratory tract infection; the second by the onset of dyspnoea and pneumonia; the third by a worsening clinical scenario dominated by a cytokine storm and the consequent hyperinflammatory state; and the fourth by death or recovery. Currently, no treatment can act specifically against the SARS-CoV-2 infection. Based on the pathological features and different clinical phases of COVID-19, particularly in patients with moderate to severe COVID-19, the classes of drugs used are antiviral agents, inflammation inhibitors/antirheumatic drugs, low molecular weight heparins, plasma, and hyperimmune immunoglobulins. During this emergency period of the COVID-19 outbreak, clinical researchers are using and testing a variety of possible treatments. Based on these premises, this review aims to discuss the most updated pharmacological treatments to effectively act against the SARS-CoV-2 infection and support researchers and clinicians in relation to any current and future developments in curing COVID-19 patients.", "date": "2020 Dec 15"}, {"pmid": "33307513", "title": "COVID-19 and cancer: From basic mechanisms to vaccine development using nanotechnology.", "authors": ["Han, Hyun Jee", "Nwagwu, Chinekwu", "Anyim, Obumneme", "Ekweremadu, Chinedu", "Kim, San"], "abstract": "Coronavirus disease 2019 (COVID-19), caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), is a global pandemic which has induced unprecedented ramifications, severely affecting our society due to the long incubation time, unpredictably high prevalence and lack of effective vaccines. One of the interesting notions is that there is an association between COVID-19 and cancer. Cancer patients seem to exhibit exacerbated conditions and a higher mortality rate when exposed to the virus. Therefore, vaccines are the promising solution to minimise the problem amongst cancer patients threatened by the new viral strains. However, there are still limitations to be considered, including the efficacy of COVID vaccines for immunocompromised individuals, possible interactions between the vaccine and cancer, and personalised medicine. Not only to eradicate the pandemic, but also to make it more effective for immunocompromised patients who are suffering from cancer, a successful vaccine platform is required through the implementation of nanotechnology which can also enable scalable manufacturing and worldwide distribution along with its faster and precise delivery. In this review, we summarise the current understanding of COVID-19 with clinical perspectives, highlighting the association between COVID-19 and cancer, followed by a vaccine development for this association using nanotechnology. We suggest different administration methods for the COVID-19 vaccine formulation options. This study will contribute to paving the way towards the prevention and treatment of COVID-19, especially for the immunocompromised individuals.", "date": "2021 Jan"}, {"pmid": "35105985", "title": "Pathological sequelae of long-haul COVID.", "authors": ["Mehandru, Saurabh", "Merad, Miriam"], "abstract": "The world continues to contend with successive waves of coronavirus disease 2019 (COVID-19), fueled by the emergence of viral variants. At the same time, persistent, prolonged and often debilitating sequelae are increasingly recognized in convalescent individuals, named 'post-COVID-19 syndrome' or 'long-haul COVID'. Clinical symptomatology includes fatigue, malaise, dyspnea, defects in memory and concentration and a variety of neuropsychiatric syndromes as the major manifestations, and several organ systems can be involved. The underlying pathophysiological mechanisms are poorly understood at present. This Review details organ-specific sequelae of post-COVID-19 syndromes and examines the underlying pathophysiological mechanisms available so far, elaborating on persistent inflammation, induced autoimmunity and putative viral reservoirs. Finally, we propose diagnostic strategies to better understand this heterogeneous disorder that continues to afflict millions of people worldwide.", "date": "2022 Feb"}, {"pmid": "33506952", "title": "Role of Toll-like receptors in the pathogenesis of COVID-19.", "authors": ["Khanmohammadi, Shaghayegh", "Rezaei, Nima"], "abstract": "Coronavirus disease 2019 (COVID-19), caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has led to a pandemic since March 2020. The exact pathogenesis of SARS-CoV-2 and the role of each component of the innate and adaptive immune system is still unknown. However, available data from other coronavirus families, such as SARS-CoV and the Middle East respiratory syndrome and also new findings could be useful for a better understanding of SARS-CoV-2. Toll-like receptors (TLR) play an important role in recognition of viral particles and activation of the innate immune system. Activation of TLR pathways leads to secretion of pro-inflammatory cytokines, such as interleukin-1 (IL-1), IL-6, and tumor necrosis factor-α, as well as type 1 interferon. Different TLRs, like TLR2, TLR3, TLR4, TLR6, TLR7, TLR8, and TLR9 are potentially important in COVID-19 infection. It is also worth mentioning that we should bear in mind both the beneficial and harmful effects of TLR in confronting COVID-19 infection. TLRs could be a potential target in controlling the infection in the early stages of disease and production of vaccine against SARS-CoV-2.", "date": "2021 May"}, {"pmid": "33305456", "title": "COVID-19: Virology, biology and novel laboratory diagnosis.", "authors": ["Mohamadian, Malihe", "Chiti, Hossein", "Shoghli, Alireza", "Biglari, Sajjad", "Parsamanesh, Negin", "Esmaeilzadeh, Abdolreza"], "abstract": "BACKGROUND: At the end of December 2019, a novel coronavirus tentatively named SARS-CoV-2 in Wuhan, a central city in China, was announced by the World Health Organization. SARS-CoV-2 is an RNA virus that has become a major public health concern after the outbreak of the Middle East Respiratory Syndrome-CoV (MERS-CoV) and Severe Acute Respiratory Syndrome-CoV (SARS-CoV) in 2002 and 2012, respectively. As of 29 October 2020, the total number of COVID-19 cases had reached over 44 million worldwide, with more than 1.17 million confirmed deaths. DISCUSSION: SARS-CoV-2 infected patients usually present with severe viral pneumonia. Similar to SARS-CoV, the virus enters respiratory tract cells via the angiotensin-converting enzyme receptor 2. The structural proteins play an essential role in budding the virus particles released from different host cells. To date, an approved vaccine or treatment option of a preventive character to avoid severe courses of COVID-19 is still not available. CONCLUSIONS: In the present study, we provide a brief review of the general biological features of CoVs and explain the pathogenesis, clinical symptoms and diagnostic approaches regarding monitoring future infectivity and prevent emerging COVID-19 infections.", "date": "2021 Feb"}, {"pmid": "33244462", "title": "An Update on Molecular Diagnostics for COVID-19.", "authors": ["Islam, Khursheed Ul", "Iqbal, Jawed"], "abstract": "A novel strain of Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) disease (COVID-19) has been recently identified as an infectious disease affecting the respiratory system of humans. This disease is caused by SARS-CoV-2 that was identified in Chinese patients having severe pneumonia and flu-like symptoms. COVID-19 is a contagious disease that spreads rapidly via droplet particles arising through sneezing and coughing action of an infected person. The reports of asymptomatic carriers changed the scenario of symptom based-diagnosis in COVID-19 and intensified the need for proper diagnosis of the majority of the population to combat the rapid transmission of virus. The diagnosis of positive cases is necessary to ensure prompt care to affected people and also to curb further spread of infection in the population. Collecting samples at the right time and from the exact anatomical site is crucial for proper molecular diagnosis. After the complete genome sequence was available, China formulated RT-PCR as a primary diagnostic procedure for detecting SARS-CoV-2. Many in-house and commercial diagnostic kits have been developed or are under development that have a potential to lower the burden of diagnosis on the primary diagnostic techniques like RT-PCR. Serological based diagnosis is another broad category of testing that can detect different serum antibodies like IgG, IgM, and IgA in an infected patient. PCR-based diagnostic procedures that are commonly used for pathogen detection need sophisticated machines and assistance of a technical expert. Despite their reliable accuracy, they are not cost-effective tests, which a common man can afford, so it becomes imperative to look for other diagnostic approaches, which could be cost effective, rapid, and sensitive with consistent accuracy. To make such diagnostics available to the common man, many techniques can be exploited among, which are Point of Care (POC), also known as bed side testing, which is developing as a portable and promising tool in pathogen diagnosis. Other lateral flow assay (LFA)-based techniques like SHERLOCK, CRISPR-Cas12a (AIOD-CRISPR), and FNCAS9 editor-limited uniform detection assay (FELUDA), etc. have shown promising results in rapid detection of pathogens. Diagnosis holds a critical importance in the pandemic situation when there is no potential drug for the pathogen available in the market. This review sums up the different diagnostic approaches designed or proposed to combat the crisis of widespread diagnosis due to the sudden outbreak of a novel pathogen, SARS-CoV-2 in 2019.", "date": "2020"}, {"pmid": "33435929", "title": "Insights to SARS-CoV-2 life cycle, pathophysiology, and rationalized treatments that target COVID-19 clinical complications.", "authors": ["Trougakos, Ioannis P", "Stamatelopoulos, Kimon", "Terpos, Evangelos", "Tsitsilonis, Ourania E", "Aivalioti, Evmorfia", "Paraskevis, Dimitrios", "Kastritis, Efstathios", "Pavlakis, George N", "Dimopoulos, Meletios A"], "abstract": "BACKGROUND: Gaining further insights into SARS-CoV-2 routes of infection and the underlying pathobiology of COVID-19 will support the design of rational treatments targeting the life cycle of the virus and/or the adverse effects (e.g., multi-organ collapse) that are triggered by COVID-19-mediated adult respiratory distress syndrome (ARDS) and/or other pathologies. MAIN BODY: COVID-19 is a two-phase disease being marked by (phase 1) increased virus transmission and infection rates due to the wide expression of the main infection-related ACE2, TMPRSS2 and CTSB/L human genes in tissues of the respiratory and gastrointestinal tract, as well as by (phase 2) host- and probably sex- and/or age-specific uncontrolled inflammatory immune responses which drive hyper-cytokinemia, aggressive inflammation and (due to broad organotropism of SARS-CoV-2) collateral tissue damage and systemic failure likely because of imbalanced ACE/ANGII/AT1R and ACE2/ANG(1-7)/MASR axes signaling. CONCLUSION: Here we discuss SARS-CoV-2 life cycle and a number of approaches aiming to suppress viral infection rates or propagation; increase virus antigen presentation in order to activate a robust and durable adaptive immune response from the host, and/or mitigate the ARDS-related \"cytokine storm\" and collateral tissue damage that triggers the severe life-threatening complications of COVID-19.", "date": "2021 Jan 12"}, {"pmid": "33617700", "title": "COVID-19 and neurology perspective.", "authors": ["Singh, Shivani", "Ahirwar, Ashok Kumar", "Asia, Priyanka", "Gopal, Niranjan", "Kaim, Kirti", "Ahirwar, Pradeep"], "abstract": "COVID-19 caused by SARS CoV2 (The novel corona virus) has already taken lives of many people across the globe even more than anyone could have imagined. This outbreak occurred in China and since then it is expanding its devastating effects by leaps and bounds. Initially it appeared to be an outbreak of pneumonia but soon it was found to be much more than that and the infectivity was found to be very high. This is the reason that it has taken whole globe in its trap and become a pandemic in such a short span of time. Death is occurring because it is a new virus and human body has no specific antibodies for it. Presently there is no approved vaccine so everyone is susceptible but people with co-morbidities appear to be in more risk and the best way for protection is social distancing and increasing one's natural immunity by taking healthy diet and exercise. When a person is infected the clinical presentation ranges from asymptomatic to severe ARDS, sudden onset of anosmia, headache, cough may be the initial symptoms. This review is focused on immunopathology and effect of COVID-19 on neurological disorders and also the neurological manifestations and the treatment.", "date": "2021 Feb 23"}, {"pmid": "33010669", "title": "The novel coronavirus Disease-2019 (COVID-19): Mechanism of action, detection and recent therapeutic strategies.", "authors": ["Seyed Hosseini, Elahe", "Riahi Kashani, Narjes", "Nikzad, Hossein", "Azadbakht, Javid", "Hassani Bafrani, Hassan", "Haddad Kashani, Hamed"], "abstract": "Novel coronavirus SARS-CoV-2, designated as COVID-19 by the World Health Organization (WHO) on the February 11, 2020, is one of the highly pathogenic β-coronaviruses which infects human. Early diagnosis of COVID-19 is the most critical step to treat infection. The diagnostic tools are generally molecular methods, serology and viral culture. Recently CRISPR-based method has been investigated to diagnose and treat coronavirus infection. The emergence of 2019-nCoV during the influenza season, has led to the extensive use of antibiotics and neuraminidase enzyme inhibitors, taken orally and intravenously. Currently, antiviral inhibitors of SARS and MERS spike proteins, neuraminidase inhibitors, anti-inflammatory drugs and EK1 peptide are the available therapeutic options for SARS-CoV-2 infected individuals. In addition, Chloroquine, which was previously used for malarial and autoimmune disease, has shown efficacy in the 2019-nCoV infection treatment. In severe hypoxaemia, a combination of antibiotics, α-interferon, lopinavir and mechanical ventilation can effectively mitigate the symptoms. Comprehensive knowledge on the innate and adaptive immune responses, will make it possible to propose potent antiviral drugs with their effective therapeutic measures for the prevention of viral infection. This therapeutic strategy will help patients worldwide to protect themselves against severe and fatal viral infections, that potentially can evolve and develop drug resistance, and to reduce mortality rates.", "date": "2020 Dec"}, {"pmid": "33666147", "title": "Lessons learned 1 year after SARS-CoV-2 emergence leading to COVID-19 pandemic.", "authors": ["To, Kelvin Kai-Wang", "Sridhar, Siddharth", "Chiu, Kelvin Hei-Yeung", "Hung, Derek Ling-Lung", "Li, Xin", "Hung, Ivan Fan-Ngai", "Tam, Anthony Raymond", "Chung, Tom Wai-Hin", "Chan, Jasper Fuk-Woo", "Zhang, Anna Jian-Xia", "Cheng, Vincent Chi-Chung", "Yuen, Kwok-Yung"], "abstract": "Without modern medical management and vaccines, the severity of the Coronavirus Disease 2019 (COVID-19) pandemic caused by severe acute respiratory syndrome (SARS) coronavirus 2 (SARS-CoV-2) might approach the magnitude of 1894-plague (12 million deaths) and 1918-A(H1N1) influenza (50 million deaths) pandemics. The COVID-19 pandemic was heralded by the 2003 SARS epidemic which led to the discovery of human and civet SARS-CoV-1, bat SARS-related-CoVs, Middle East respiratory syndrome (MERS)-related bat CoV HKU4 and HKU5, and other novel animal coronaviruses. The suspected animal-to-human jumping of 4 betacoronaviruses including the human coronaviruses OC43(1890), SARS-CoV-1(2003), MERS-CoV(2012), and SARS-CoV-2(2019) indicates their significant pandemic potential. The presence of a large reservoir of coronaviruses in bats and other wild mammals, culture of mixing and selling them in urban markets with suboptimal hygiene, habit of eating exotic mammals in highly populated areas, and the rapid and frequent air travels from these areas are perfect ingredients for brewing rapidly exploding epidemics. The possibility of emergence of a hypothetical SARS-CoV-3 or other novel viruses from animals or laboratories, and therefore needs for global preparedness should not be ignored. We reviewed representative publications on the epidemiology, virology, clinical manifestations, pathology, laboratory diagnostics, treatment, vaccination, and infection control of COVID-19 as of 20 January 2021, which is 1 year after person-to-person transmission of SARS-CoV-2 was announced. The difficulties of mass testing, labour-intensive contact tracing, importance of compliance to universal masking, low efficacy of antiviral treatment for severe disease, possibilities of vaccine or antiviral-resistant virus variants and SARS-CoV-2 becoming another common cold coronavirus are discussed.", "date": "2021 Dec"}]