[{"pmid": "33024307", "title": "Characteristics of SARS-CoV-2 and COVID-19.", "authors": ["Hu, Ben", "Guo, Hua", "Zhou, Peng", "Shi, Zheng-Li"], "abstract": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a highly transmissible and pathogenic coronavirus that emerged in late 2019 and has caused a pandemic of acute respiratory disease, named 'coronavirus disease 2019' (COVID-19), which threatens human health and public safety. In this Review, we describe the basic virology of SARS-CoV-2, including genomic characteristics and receptor use, highlighting its key difference from previously known coronaviruses. We summarize current knowledge of clinical, epidemiological and pathological features of COVID-19, as well as recent progress in animal models and antiviral treatment approaches for SARS-CoV-2 infection. We also discuss the potential wildlife hosts and zoonotic origin of this emerging virus in detail.", "date": "2021 Mar"}, {"pmid": "35105985", "title": "Pathological sequelae of long-haul COVID.", "authors": ["Mehandru, Saurabh", "Merad, Miriam"], "abstract": "The world continues to contend with successive waves of coronavirus disease 2019 (COVID-19), fueled by the emergence of viral variants. At the same time, persistent, prolonged and often debilitating sequelae are increasingly recognized in convalescent individuals, named 'post-COVID-19 syndrome' or 'long-haul COVID'. Clinical symptomatology includes fatigue, malaise, dyspnea, defects in memory and concentration and a variety of neuropsychiatric syndromes as the major manifestations, and several organ systems can be involved. The underlying pathophysiological mechanisms are poorly understood at present. This Review details organ-specific sequelae of post-COVID-19 syndromes and examines the underlying pathophysiological mechanisms available so far, elaborating on persistent inflammation, induced autoimmunity and putative viral reservoirs. Finally, we propose diagnostic strategies to better understand this heterogeneous disorder that continues to afflict millions of people worldwide.", "date": "2022 Feb"}, {"pmid": "35163638", "title": "SARS-CoV-2-Specific Immune Response and the Pathogenesis of COVID-19.", "authors": ["Gusev, Evgenii", "Sarapultsev, Alexey", "Solomatina, Liliya", "Chereshnev, Valeriy"], "abstract": "The review aims to consolidate research findings on the molecular mechanisms and virulence and pathogenicity characteristics of coronavirus disease (COVID-19) causative agent, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), and their relevance to four typical stages in the development of acute viral infection. These four stages are invasion; primary blockade of antiviral innate immunity; engagement of the virus's protection mechanisms against the factors of adaptive immunity; and acute, long-term complications of COVID-19. The invasion stage entails the recognition of the spike protein (S) of SARS-CoV-2 target cell receptors, namely, the main receptor (angiotensin-converting enzyme 2, ACE2), its coreceptors, and potential alternative receptors. The presence of a diverse repertoire of receptors allows SARS-CoV-2 to infect various types of cells, including those not expressing ACE2. During the second stage, the majority of the polyfunctional structural, non-structural, and extra proteins SARS-CoV-2 synthesizes in infected cells are involved in the primary blockage of antiviral innate immunity. A high degree of redundancy and systemic action characterizing these pathogenic factors allows SARS-CoV-2 to overcome antiviral mechanisms at the initial stages of invasion. The third stage includes passive and active protection of the virus from factors of adaptive immunity, overcoming of the barrier function at the focus of inflammation, and generalization of SARS-CoV-2 in the body. The fourth stage is associated with the deployment of variants of acute and long-term complications of COVID-19. SARS-CoV-2's ability to induce autoimmune and autoinflammatory pathways of tissue invasion and development of both immunosuppressive and hyperergic mechanisms of systemic inflammation is critical at this stage of infection.", "date": "2022 Feb 2"}, {"pmid": "33053381", "title": "Treatment for COVID-19: An overview.", "authors": ["Stasi, Cristina", "Fallani, Silvia", "Voller, Fabio", "Silvestri, Caterina"], "abstract": "Coronavirus disease 2019 (COVID-19) is an infectious disease caused by coronavirus-2 (SARS-CoV-2) that causes a severe acute respiratory syndrome, a characteristic hyperinflammatory response, vascular damage, microangiopathy, angiogenesis and widespread thrombosis. Four stages of COVID-19 have been identified: the first stage is characterised by upper respiratory tract infection; the second by the onset of dyspnoea and pneumonia; the third by a worsening clinical scenario dominated by a cytokine storm and the consequent hyperinflammatory state; and the fourth by death or recovery. Currently, no treatment can act specifically against the SARS-CoV-2 infection. Based on the pathological features and different clinical phases of COVID-19, particularly in patients with moderate to severe COVID-19, the classes of drugs used are antiviral agents, inflammation inhibitors/antirheumatic drugs, low molecular weight heparins, plasma, and hyperimmune immunoglobulins. During this emergency period of the COVID-19 outbreak, clinical researchers are using and testing a variety of possible treatments. Based on these premises, this review aims to discuss the most updated pharmacological treatments to effectively act against the SARS-CoV-2 infection and support researchers and clinicians in relation to any current and future developments in curing COVID-19 patients.", "date": "2020 Dec 15"}, {"pmid": "32265180", "title": "Genotype and phenotype of COVID-19: Their roles in pathogenesis.", "authors": ["Mousavizadeh, Leila", "Ghasemi, Sorayya"], "abstract": "COVID-19 is a novel coronavirus with an outbreak of unusual viral pneumonia in Wuhan, China, and then pandemic. Based on its phylogenetic relationships and genomic structures the COVID-19 belongs to genera Betacoronavirus. Human Betacoronaviruses (SARS-CoV-2, SARS-CoV, and MERS-CoV) have many similarities, but also have differences in their genomic and phenotypic structure that can influence their pathogenesis. COVID-19 is containing single-stranded (positive-sense) RNA associated with a nucleoprotein within a capsid comprised of matrix protein. A typical CoV contains at least six ORFs in its genome. All the structural and accessory proteins are translated from the sgRNAs of CoVs. Four main structural proteins are encoded by ORFs 10, 11 on the one-third of the genome near the 3'-terminus. The genetic and phenotypic structure of COVID-19 in pathogenesis is important. This article highlights the most important of these features compared to other Betacoronaviruses.", "date": "2021 Apr"}, {"pmid": "34241776", "title": "A Comprehensive Review of COVID-19 Virology, Vaccines, Variants, and Therapeutics.", "authors": ["Forchette, Lauren", "Sebastian, William", "Liu, Tuoen"], "abstract": "Severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), the causative pathogen of the coronavirus disease 2019 (COVID-19), has caused more than 179 million infections and 3.8 million deaths worldwide. Throughout the past year, multiple vaccines have already been developed and used, while some others are in the process of being developed. However, the emergence of new mutant strains of SARS-CoV-2 that have demonstrated immune-evading characteristics and an increase in infective capabilities leads to potential ineffectiveness of the vaccines against these variants. The purpose of this review article is to highlight the current understanding of the immunological mechanisms of the virus and vaccines, as well as to investigate some key variants and mutations of the virus driving the current pandemic and their impacts on current management guidelines. We also discussed new technologies being developed for the prevention, treatment, and detection of SARS-CoV-2. In this paper, we thoroughly reviewed and provided crucial information on SARS-CoV-2 virology, vaccines and drugs being used and developed for its prevention and treatment, as well as important variant strains. Our review paper will be beneficial to health care professionals and researchers so they can have a better understanding of the basic sciences, prevention, and clinical treatment of COVID-19 during the pandemic. This paper consists of the most updated information that has been available as of June 21, 2021.", "date": "2021 Dec"}, {"pmid": "32921216", "title": "COVID-19 and cardiac injury: clinical manifestations, biomarkers, mechanisms, diagnosis, treatment, and follow up.", "authors": ["Tajbakhsh, Amir", "Gheibi Hayat, Seyed Mohammad", "Taghizadeh, Hajar", "Akbari, Ali", "Inabadi, Masoumeh", "Savardashtaki, Amir", "Johnston, Thomas P", "Sahebkar, Amirhossein"], "abstract": "INTRODUCTION: Coronavirus disease 2019 (COVID-19) has the characteristics of high transmission, diverse clinical manifestations, and a long incubation period. In addition to infecting the respiratory system, COVID-19 also has adverse effects on the cardiovascular system. COVID-19 causes acute myocardial injuries, as well as chronic damage to the cardiovascular system. AREAS COVERED: The present review is aimed at providing current information on COVID-19 and the cardiovascular system. PubMed, Scopus, Science direct, and Google Scholar were searched. EXPERT OPINION: It is suggested that heart injury caused by COVID-19 infection might be an important cause of severe clinical phenotypes or adverse events in affected patients. Myocardial damage is closely related to the severity of the disease and even the prognosis in patients with COVID-19. In addition to disorders that are caused by COVID-19 on the cardiovascular system, more protection should be employed for patients with preexisting cardiovascular disease (CVD). Hence, it is very important that once relevant symptoms appear, patients with COVID-19 be rapidly treated to reduce mortality. Thus, early measurements of cardiac damage via biomarkers following hospitalization for COVID-19 infections in a patient with preexisting CVD are recommended, together with careful monitoring of any myocardial injury that might be caused by the infection.Abbreviations: ICU: An intensive care unit; 2019-nCoV: 2019 novel coronavirus; ACEI: ACE inhibitor; ACS: Acute coronary syndrome; ARDS: Acute respiratory distress syndrome; AT(1)R: Ang II type 1 receptor; ATP: Adenosine triphosphate; ACC: American College of Cardiology; ACE: Angiotensin converting enzyme; Ang II: Angiotensin II; ARB: Angiotensin II receptor blocker; AV block: Atrioventricular block; CAD: Coronary artery disease; CVD: Cardiovascular disease; CT: Computerized tomography; CHF: Congestive heart failure; CHD: Coronary heart disease; CK-MB: Creatine kinase isoenzyme-MB; CRP: C-reactive protein; cTnI: Cardiac troponin I; EAT: Epicardial adipose tissue; ECMO: Extracorporeal membrane oxygenation; FDA: Food and Drug Administration; G-CSF: Granulocyte colony-stimulating factor; HFrEF: HF with a reduced ejection fraction; synhACE2: Human isoform of ACE2; IL: Interleukin; IABP: Intra-aortic balloon counterpulsation; IP10: Interferon γ-induced protein 10 kDa; LPC: Lysophosphatidylcholine; Mas: Mitochondrial assembly receptor; MCP1: Monocyte chemoattractant protein-1; MERS: Middle East respiratory syndrome; MIP1a: macrophage inflammatory protein 1a: MOF: Multiple organ failure; MI: Myocardial infarction; MRI: Magnetic resonance imaging; MYO: Myohe-moglobin; NT-proBNP: N-terminal pro-brain natriuretic peptide; PCPS: Percutaneous cardiopulmonary assistance; rhACE2: Recombinant human ACE2; SARS: Severe acute respiratory syndrome; Th: T helper; RAS: Renin-angiotensin system; TNF-α: Tumor necrosis factor-α; WHO: World Health Organization.", "date": "2021 Mar"}, {"pmid": "32679589", "title": "Supplementation with vitamin D in the COVID-19 pandemic?", "authors": ["Hadizadeh, Fatemeh"], "abstract": "The coronavirus disease 2019 (COVID-19) pandemic was declared a public health emergency of international concern by the World Health Organization. COVID-19 has high transmissibility and could result in acute lung injury in a fraction of patients. By counterbalancing the activity of the renin-angiotensin system, angiotensin-converting enzyme 2, which is the fusion receptor of the virus, plays a protective role against the development of complications of this viral infection. Vitamin D can induce the expression of angiotensin-converting enzyme 2 and regulate the immune system through different mechanisms. Epidemiologic studies of the relationship between vitamin D and various respiratory infections were reviewed and, here, the postulated mechanisms and clinical data supporting the protective role of vitamin D against COVID-19-mediated complications are discussed.", "date": "2021 Jan 9"}, {"pmid": "33139015", "title": "Laboratory testing for the diagnosis of COVID-19.", "authors": ["Lai, Christopher K C", "Lam, Wilson"], "abstract": "Rapid and accurate laboratory diagnosis of active COVID-19 infection is one of the cornerstones of pandemic control. With the myriad of tests available in the market, the use of correct specimen type and laboratory-testing technique in the right clinical scenario could be challenging for non-specialists. In this mini-review, we will discuss the difference in diagnostic performance for different upper and lower respiratory tract specimens, and the role of blood and fecal specimens. We will analyze the performance characteristics of laboratory testing techniques of nucleic acid amplification tests, antigen detection tests, antibody detection tests, and point-of-care tests. Finally, the dynamics of viral replication and antibody production, and laboratory results interpretation in conjunction with clinical scenarios will be discussed.", "date": "2021 Jan 29"}, {"pmid": "33305456", "title": "COVID-19: Virology, biology and novel laboratory diagnosis.", "authors": ["Mohamadian, Malihe", "Chiti, Hossein", "Shoghli, Alireza", "Biglari, Sajjad", "Parsamanesh, Negin", "Esmaeilzadeh, Abdolreza"], "abstract": "BACKGROUND: At the end of December 2019, a novel coronavirus tentatively named SARS-CoV-2 in Wuhan, a central city in China, was announced by the World Health Organization. SARS-CoV-2 is an RNA virus that has become a major public health concern after the outbreak of the Middle East Respiratory Syndrome-CoV (MERS-CoV) and Severe Acute Respiratory Syndrome-CoV (SARS-CoV) in 2002 and 2012, respectively. As of 29 October 2020, the total number of COVID-19 cases had reached over 44 million worldwide, with more than 1.17 million confirmed deaths. DISCUSSION: SARS-CoV-2 infected patients usually present with severe viral pneumonia. Similar to SARS-CoV, the virus enters respiratory tract cells via the angiotensin-converting enzyme receptor 2. The structural proteins play an essential role in budding the virus particles released from different host cells. To date, an approved vaccine or treatment option of a preventive character to avoid severe courses of COVID-19 is still not available. CONCLUSIONS: In the present study, we provide a brief review of the general biological features of CoVs and explain the pathogenesis, clinical symptoms and diagnostic approaches regarding monitoring future infectivity and prevent emerging COVID-19 infections.", "date": "2021 Feb"}]