[{"pmid": "34333882", "title": "COVID-19 and lung pathologies.", "authors": ["Purohit, Darshana", "Ahirwar, Ashok Kumar", "Sakarde, Apurva", "Asia, Priyanka", "Gopal, Niranjan"], "abstract": "COVID-19 is a global emergency with over 10 million cases and over 500, 000 deaths worldwide. The SARS CoV-2 is a RNA virus belonging to the family coronaviridae. It has high infectivity. The manifestations of the disease range from asymptomatic or mild symptoms to severe pneumonia and ARDS. The CT scan of lung shows consolidation and \"Ground Glass Opacities\". The persons with other comorbidities are considered to be at a higher rate of acquiring the infection. Asthma and other allergies have not been identified as major risk factors for COVID-19 as the number of asthmatic patients having COVID-19 is not high enough for it to be considered so. The occurrence of COVID-19 in COPD patients can be related with smoking. The ACE-2 expression in such patients was considerably high. The relation between COVID-19 and Tuberculosis can also be reflected in terms of the stigma associated with diagnosis and treatment of such diseases in some communities, eventually increasing the chances of people's reluctance to seek medical help. Cancer patients are usually more susceptible to infections. Lung cancer is no different. Additionally, lung cancer also has strong association with smoking further increasing the risk. The risk of getting infection and its severity is high for autoimmune disorders as well as fungal infections. Currently there is no definite treatment of COVID-19. However, some of the currently used modalities are hydroxychloroquine and antiviral drugs.", "date": "2021 Aug 2"}, {"pmid": "33053381", "title": "Treatment for COVID-19: An overview.", "authors": ["Stasi, Cristina", "Fallani, Silvia", "Voller, Fabio", "Silvestri, Caterina"], "abstract": "Coronavirus disease 2019 (COVID-19) is an infectious disease caused by coronavirus-2 (SARS-CoV-2) that causes a severe acute respiratory syndrome, a characteristic hyperinflammatory response, vascular damage, microangiopathy, angiogenesis and widespread thrombosis. Four stages of COVID-19 have been identified: the first stage is characterised by upper respiratory tract infection; the second by the onset of dyspnoea and pneumonia; the third by a worsening clinical scenario dominated by a cytokine storm and the consequent hyperinflammatory state; and the fourth by death or recovery. Currently, no treatment can act specifically against the SARS-CoV-2 infection. Based on the pathological features and different clinical phases of COVID-19, particularly in patients with moderate to severe COVID-19, the classes of drugs used are antiviral agents, inflammation inhibitors/antirheumatic drugs, low molecular weight heparins, plasma, and hyperimmune immunoglobulins. During this emergency period of the COVID-19 outbreak, clinical researchers are using and testing a variety of possible treatments. Based on these premises, this review aims to discuss the most updated pharmacological treatments to effectively act against the SARS-CoV-2 infection and support researchers and clinicians in relation to any current and future developments in curing COVID-19 patients.", "date": "2020 Dec 15"}, {"pmid": "32265180", "title": "Genotype and phenotype of COVID-19: Their roles in pathogenesis.", "authors": ["Mousavizadeh, Leila", "Ghasemi, Sorayya"], "abstract": "COVID-19 is a novel coronavirus with an outbreak of unusual viral pneumonia in Wuhan, China, and then pandemic. Based on its phylogenetic relationships and genomic structures the COVID-19 belongs to genera Betacoronavirus. Human Betacoronaviruses (SARS-CoV-2, SARS-CoV, and MERS-CoV) have many similarities, but also have differences in their genomic and phenotypic structure that can influence their pathogenesis. COVID-19 is containing single-stranded (positive-sense) RNA associated with a nucleoprotein within a capsid comprised of matrix protein. A typical CoV contains at least six ORFs in its genome. All the structural and accessory proteins are translated from the sgRNAs of CoVs. Four main structural proteins are encoded by ORFs 10, 11 on the one-third of the genome near the 3'-terminus. The genetic and phenotypic structure of COVID-19 in pathogenesis is important. This article highlights the most important of these features compared to other Betacoronaviruses.", "date": "2021 Apr"}, {"pmid": "33139015", "title": "Laboratory testing for the diagnosis of COVID-19.", "authors": ["Lai, Christopher K C", "Lam, Wilson"], "abstract": "Rapid and accurate laboratory diagnosis of active COVID-19 infection is one of the cornerstones of pandemic control. With the myriad of tests available in the market, the use of correct specimen type and laboratory-testing technique in the right clinical scenario could be challenging for non-specialists. In this mini-review, we will discuss the difference in diagnostic performance for different upper and lower respiratory tract specimens, and the role of blood and fecal specimens. We will analyze the performance characteristics of laboratory testing techniques of nucleic acid amplification tests, antigen detection tests, antibody detection tests, and point-of-care tests. Finally, the dynamics of viral replication and antibody production, and laboratory results interpretation in conjunction with clinical scenarios will be discussed.", "date": "2021 Jan 29"}, {"pmid": "32679589", "title": "Supplementation with vitamin D in the COVID-19 pandemic?", "authors": ["Hadizadeh, Fatemeh"], "abstract": "The coronavirus disease 2019 (COVID-19) pandemic was declared a public health emergency of international concern by the World Health Organization. COVID-19 has high transmissibility and could result in acute lung injury in a fraction of patients. By counterbalancing the activity of the renin-angiotensin system, angiotensin-converting enzyme 2, which is the fusion receptor of the virus, plays a protective role against the development of complications of this viral infection. Vitamin D can induce the expression of angiotensin-converting enzyme 2 and regulate the immune system through different mechanisms. Epidemiologic studies of the relationship between vitamin D and various respiratory infections were reviewed and, here, the postulated mechanisms and clinical data supporting the protective role of vitamin D against COVID-19-mediated complications are discussed.", "date": "2021 Jan 9"}, {"pmid": "33307513", "title": "COVID-19 and cancer: From basic mechanisms to vaccine development using nanotechnology.", "authors": ["Han, Hyun Jee", "Nwagwu, Chinekwu", "Anyim, Obumneme", "Ekweremadu, Chinedu", "Kim, San"], "abstract": "Coronavirus disease 2019 (COVID-19), caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), is a global pandemic which has induced unprecedented ramifications, severely affecting our society due to the long incubation time, unpredictably high prevalence and lack of effective vaccines. One of the interesting notions is that there is an association between COVID-19 and cancer. Cancer patients seem to exhibit exacerbated conditions and a higher mortality rate when exposed to the virus. Therefore, vaccines are the promising solution to minimise the problem amongst cancer patients threatened by the new viral strains. However, there are still limitations to be considered, including the efficacy of COVID vaccines for immunocompromised individuals, possible interactions between the vaccine and cancer, and personalised medicine. Not only to eradicate the pandemic, but also to make it more effective for immunocompromised patients who are suffering from cancer, a successful vaccine platform is required through the implementation of nanotechnology which can also enable scalable manufacturing and worldwide distribution along with its faster and precise delivery. In this review, we summarise the current understanding of COVID-19 with clinical perspectives, highlighting the association between COVID-19 and cancer, followed by a vaccine development for this association using nanotechnology. We suggest different administration methods for the COVID-19 vaccine formulation options. This study will contribute to paving the way towards the prevention and treatment of COVID-19, especially for the immunocompromised individuals.", "date": "2021 Jan"}, {"pmid": "33868239", "title": "Genetics Insight for COVID-19 Susceptibility and Severity: A Review.", "authors": ["Fricke-Galindo, Ingrid", "Falfán-Valencia, Ramcés"], "abstract": "Coronavirus disease (COVID-19) presents a broad spectrum of clinical manifestations ranging from an asymptomatic to a severe clinical course. The host genetic background influence on the susceptibility and outcome of multiples infectious diseases has been previously reported. Herein, we aimed to describe relevant identified genetic variants and those potentially related to the inter-individual variability of COVID-19 susceptibility and/or severity considering the physiopathological pathway of the disease The HLA-A*25:01, -B*15:27, -B*46:01, -C*01:02, and -C*07:29 alleles have been associated with COVID-19 susceptibility; while HLA-A*02:02, -B*15:03, and -C*12:03 have been identified as low-risk alleles. Variants in cytokine genes such as IL1B, IL1R1, IL1RN, IL6, IL17A, FCGR2A, and TNF could be related to disease susceptibility and cytokine storm, and/or COVID-19 complications (e.g., venous thrombosis). Several variants in ACE2 and TMPRSS2 affecting the expression of the receptors related to COVID-19 have been associated with the disease susceptibility and risk factors. Finally, two GWAS have identified the loci 3p21.31 (LZTFL1, SLC6A20, CCR9, FYCO1, CXCR6, and XCR1) and 9q34.2 (ABO) with COVID-19 severity. Heterogeneous results in the association of genetic variants with COVID-19 susceptibility and severity were observed. The mechanism of identified risk-genes and studies in different populations are still warranted.", "date": "2021"}, {"pmid": "32921216", "title": "COVID-19 and cardiac injury: clinical manifestations, biomarkers, mechanisms, diagnosis, treatment, and follow up.", "authors": ["Tajbakhsh, Amir", "Gheibi Hayat, Seyed Mohammad", "Taghizadeh, Hajar", "Akbari, Ali", "Inabadi, Masoumeh", "Savardashtaki, Amir", "Johnston, Thomas P", "Sahebkar, Amirhossein"], "abstract": "INTRODUCTION: Coronavirus disease 2019 (COVID-19) has the characteristics of high transmission, diverse clinical manifestations, and a long incubation period. In addition to infecting the respiratory system, COVID-19 also has adverse effects on the cardiovascular system. COVID-19 causes acute myocardial injuries, as well as chronic damage to the cardiovascular system. AREAS COVERED: The present review is aimed at providing current information on COVID-19 and the cardiovascular system. PubMed, Scopus, Science direct, and Google Scholar were searched. EXPERT OPINION: It is suggested that heart injury caused by COVID-19 infection might be an important cause of severe clinical phenotypes or adverse events in affected patients. Myocardial damage is closely related to the severity of the disease and even the prognosis in patients with COVID-19. In addition to disorders that are caused by COVID-19 on the cardiovascular system, more protection should be employed for patients with preexisting cardiovascular disease (CVD). Hence, it is very important that once relevant symptoms appear, patients with COVID-19 be rapidly treated to reduce mortality. Thus, early measurements of cardiac damage via biomarkers following hospitalization for COVID-19 infections in a patient with preexisting CVD are recommended, together with careful monitoring of any myocardial injury that might be caused by the infection.Abbreviations: ICU: An intensive care unit; 2019-nCoV: 2019 novel coronavirus; ACEI: ACE inhibitor; ACS: Acute coronary syndrome; ARDS: Acute respiratory distress syndrome; AT(1)R: Ang II type 1 receptor; ATP: Adenosine triphosphate; ACC: American College of Cardiology; ACE: Angiotensin converting enzyme; Ang II: Angiotensin II; ARB: Angiotensin II receptor blocker; AV block: Atrioventricular block; CAD: Coronary artery disease; CVD: Cardiovascular disease; CT: Computerized tomography; CHF: Congestive heart failure; CHD: Coronary heart disease; CK-MB: Creatine kinase isoenzyme-MB; CRP: C-reactive protein; cTnI: Cardiac troponin I; EAT: Epicardial adipose tissue; ECMO: Extracorporeal membrane oxygenation; FDA: Food and Drug Administration; G-CSF: Granulocyte colony-stimulating factor; HFrEF: HF with a reduced ejection fraction; synhACE2: Human isoform of ACE2; IL: Interleukin; IABP: Intra-aortic balloon counterpulsation; IP10: Interferon γ-induced protein 10 kDa; LPC: Lysophosphatidylcholine; Mas: Mitochondrial assembly receptor; MCP1: Monocyte chemoattractant protein-1; MERS: Middle East respiratory syndrome; MIP1a: macrophage inflammatory protein 1a: MOF: Multiple organ failure; MI: Myocardial infarction; MRI: Magnetic resonance imaging; MYO: Myohe-moglobin; NT-proBNP: N-terminal pro-brain natriuretic peptide; PCPS: Percutaneous cardiopulmonary assistance; rhACE2: Recombinant human ACE2; SARS: Severe acute respiratory syndrome; Th: T helper; RAS: Renin-angiotensin system; TNF-α: Tumor necrosis factor-α; WHO: World Health Organization.", "date": "2021 Mar"}, {"pmid": "33506952", "title": "Role of Toll-like receptors in the pathogenesis of COVID-19.", "authors": ["Khanmohammadi, Shaghayegh", "Rezaei, Nima"], "abstract": "Coronavirus disease 2019 (COVID-19), caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has led to a pandemic since March 2020. The exact pathogenesis of SARS-CoV-2 and the role of each component of the innate and adaptive immune system is still unknown. However, available data from other coronavirus families, such as SARS-CoV and the Middle East respiratory syndrome and also new findings could be useful for a better understanding of SARS-CoV-2. Toll-like receptors (TLR) play an important role in recognition of viral particles and activation of the innate immune system. Activation of TLR pathways leads to secretion of pro-inflammatory cytokines, such as interleukin-1 (IL-1), IL-6, and tumor necrosis factor-α, as well as type 1 interferon. Different TLRs, like TLR2, TLR3, TLR4, TLR6, TLR7, TLR8, and TLR9 are potentially important in COVID-19 infection. It is also worth mentioning that we should bear in mind both the beneficial and harmful effects of TLR in confronting COVID-19 infection. TLRs could be a potential target in controlling the infection in the early stages of disease and production of vaccine against SARS-CoV-2.", "date": "2021 May"}, {"pmid": "32661794", "title": "Neurological Involvement in COVID-19 and Potential Mechanisms: A Review.", "authors": ["Aghagoli, Ghazal", "Gallo Marin, Benjamin", "Katchur, Nicole J", "Chaves-Sell, Franz", "Asaad, Wael F", "Murphy, Sarah A"], "abstract": "As the current understanding of COVID-19 continues to evolve, a synthesis of the literature on the neurological impact of this novel virus may help inform clinical management and highlight potentially important avenues of investigation. Additionally, understanding the potential mechanisms of neurologic injury may guide efforts to better detect and ameliorate these complications. In this review, we synthesize a range of clinical observations and initial case series describing potential neurologic manifestations of COVID-19 and place these observations in the context of coronavirus neuro-pathophysiology as it may relate to SARS-CoV-2 infection. Reported nervous system manifestations range from anosmia and ageusia, to cerebral hemorrhage and infarction. While the volume of COVID-19-related case studies continues to grow, previous work examining related viruses suggests potential mechanisms through which the novel coronavirus may impact the CNS and result in neurological complications. Namely, animal studies examining the SARS-CoV have implicated the angiotensin-converting-enzyme-2 receptor as a mediator of coronavirus-related neuronal damage and have shown that SARS-CoV can infect cerebrovascular endothelium and brain parenchyma, the latter predominantly in the medial temporal lobe, resulting in apoptosis and necrosis. Human postmortem brain studies indicate that human coronavirus variants and SARS-CoV can infect neurons and glia, implying SARS-CoV-2 may have similar neurovirulence. Additionally, studies have demonstrated an increase in cytokine serum levels as a result of SARS-CoV infection, consistent with the notion that cytokine overproduction and toxicity may be a relevant potential mechanism of neurologic injury, paralleling a known pathway of pulmonary injury. We also discuss evidence that suggests that SARS-CoV-2 may be a vasculotropic and neurotropic virus. Early reports suggest COVID-19 may be associated with severe neurologic complications, and several plausible mechanisms exist to account for these observations. A heightened awareness of the potential for neurologic involvement and further investigation into the relevant pathophysiology will be necessary to understand and ultimately mitigate SARS-CoV-2-associated neurologic injury.", "date": "2021 Jun"}]